# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные, а прописные — в строчные.

s = ("Я люБлЮ pyThON")
print(s)
a = s.swapcase()
print("Преобразованная строка:", a)