info_tov = [
   (1, 'молоко', 'козлиное', 'шт'),
   (2, 'сыр', 'горный', 'кг'),
   (3, 'сок', 'апельсиновый', 'шт'),
   (4, 'чупа-чупс', 'со вкусом клубники', 'шт'),
   (5, 'хлеб', 'ржаной', 'шт'),
   (6, 'вода', 'архыз', 'шт'),
   (7, 'конфеты', 'шоколадные', 'кг'),
   (8, 'яблоки', 'кислые', 'кг'),
   (9, 'торт', 'шоколадный с кремом', 'шт'),
   (10, 'сосиски', 'гановерские', 'шт')
]


info_mag = [
   (10, 'Магнит', 'ул. Таганрогская 40/1', '88123456789'),
   (11, 'Пятерочка', 'ул. Еременко 23', '81112332556'),
   (22, 'Светофор', 'ул. Московская 54/9', '89390550531'),
   (33, 'Колос', 'ул. Закарпатская 3', '89180643679'),
   (44, 'Магнит', 'ул. Московская 23/3', '89188099504'),
   (55, 'Пятерочка', 'ул. Шишкина 10/4', '89189806772'),
   (66, 'Хлебневъ', 'ул. Заводская 34/1', '89184823922'),
   (77, 'Магнит для семьи', 'ул. Шишкина 80/7', '89188735532'),
   (88, 'Светофор', 'ул. Автодорожная 80/5', '89183248283'),
   (99, 'Мадам Безе', 'ул. Мазилина 49', '89186484106')
]


info_zayv = [
   (10, 10, '2023-03-22'),
   (11, 11, '2023-02-30'),
   (22, 22, '2023-02-01'),
   (33, 33, '2023-04-30'),
   (44, 44, '2023-06-15'),
   (55, 55, '2023-03-26'),
   (66, 66, '2023-08-29'),
   (77, 77, '2023-10-11'),
   (88, 88, '2023-11-31'),
   (99, 99, '2023-05-13')
]


info_kol = [
   (10, 5, 20),
   (11, 4, 10),
   (22, 3, 15),
   (33, 6, 0),
   (44, 1, 45),
   (55, 2, 56),
   (66, 8, 22),
   (77, 10, 12),
   (88, 7, 29),
   (99, 9, 34)
]


info_sostav = [
   (10, 11, 2, 33),
   (11, 0, 1, 34),
   (22, 33, 3, 27),
   (33, 22, 6, 64),
   (44, 99, 4, 50),
   (55, 10, 3, 17),
   (66, 88, 5, 88),
   (77, 0, 9, 40),
   (88, 55, 8, 35),
   (99, 77, 10, 23)
]
